#### 연산자 학습 ######
# 1. 산술 연산자
# 2. 할당 연산자
# 3. 관계 연산자
# 4. 논리 연산자
# 5. 비트 연산자
# 6. 데이터 출력 표현

#### 1. 연산자 ####
# 문제 1. 2000초를 입력 받아 몇 시간, 몇 분, 몇 초 인지를 출력하는 PG 작성.
# 문제 2. 유럽 여행을 가기 위해 유로화로 환전하고자 한다. 1유로가 1355원 이라고 할 때 300만원을 환전하면 몇 유로를 받을 수 있다. 그리고 환전 후 남은 금액은 얼마인가?
# 문제 3. 컴퓨터 부품을 구입하고자 한다. 마우스의 가격은 15,000원, 키보드의 가격은 23,000원, 스피커의 가격은 30,000원이라고 하자. 마우스를 3개, 키보드를 5개, 스피커를 2개, 구입하면 지불해야할 총액은 얼마인가?
# 문제 4. 너비와 높이를 입력 받아 삼각형의 넓이를 구하는 PG 작성.
# 문제 5. 반지름을 입력 받아 원의 둘레를 구하는 PG 작성.
# 문제 6. 저축액을 입력 받아 1년 후의 이자와 원리금(원금+이자)를 출력해주는 프로그램을 작성하시오. 이자율은 3.75%, 이자에 대한 세금은 15%이다.
#           입력:  저축금액 입력: 5000000 | 출력:  원금: 5000000원, 이자: 187500원, 세금: 28125원, 최종금액: 5159375원 
# 문제 7. 화씨온도를 입력 받아 섭씨온도로 변환하는 프로그램을 작성하시오.(단, 출력은 소수 둘째자리까지 표현)
#           섭씨 = (화씨-32)*5/9
# 문제 8. 사용자로 부터 두 점의 좌표를 입력 받아 거리를 계산하는 PG 작성(단, 출력은 소수 둘째자리까지 표현)
#           거리계산 = ((x2-x1)**2+(y2-y1)**2)**0.5
# 문제 9. 물건 가격과 지불한 금액을 입력하면 거스럼 돈을 알려주는 계산대 PG 작성
#           입력: 사과: 1500, 바나나: 1200, 망고:2300, 과자:1800 , 받은돈:10000 | 출력: 받은돈: 10000원, 물건가격: 6800원, 거스럼돈: 3200원, 천원: 3장, 500원: 0개, 100원: 2개
# 문제10. 반지름과 높이를 입력받아 원기둥의 부피를 계산하는 프로그램을 작성하시오.
#          파이는 3.141592이다.	
#    [입력]  
#        높이: 100.0
#       반지름: 10.0
#    [출력]  
#       원기둥의 부피: 31415.9
# 문제 11. 사용자로부터 전수 1개를 입력받아 정수의 자리수 합을 구하는 프로그램을 작성하시오.
#    [입력]  
#        정수를 입력하시오: 12345
#    [출력]  
#       자릿수의 합: 15
